<h2>年分對應天干地支</h2>
<!-- 自己打的 -->
<?php
$sky=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
$ground=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
$year=2000;
echo $year."年是";
for ($i=0; $i <=9 ; $i++) { 
    if (($year-1024)%10==$i) {
        echo $sky[$i];
    }
}
for ($j=0; $j <=11 ; $j++) { 
    if (($year-1024)%12==$j) {
        echo $ground[$j];
    }
}
echo "年";
?>
<br>
<!-- 老師打的 -->
<?php
$year=2000;
$sky=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
$ground=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];

echo "西元".$year."年是";
echo$sky[($year-1024)%10];
echo$ground[($year-1024)%12];
echo "年";